Config/Documents/ИнвентаризацияДрагКамнейВИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияДрагКамнейВИК</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнвентаризации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоИнвентаризацииНФА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнвентаризацииДрагМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборДрагоценныйМатериал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНФА</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДрагМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаДМУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДМУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаДМФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДМФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияДрагМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыИнвентаризацииДрагМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыИнвентаризацииДрагМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияДрагМеталловВНФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияДрагМеталловВЛомеОтходах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияДрагКамнейВНФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияДрагКамнейВЛомеОтходах</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПФС</Name>
					<Comment>Руководитель планово-финансовой службы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйИсполнительКадры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ЦМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЦМО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ИнвентаризацияДрагКамнейВИК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияДрагКамнейВИК";
	КомандаПечати.Идентификатор = "ИнвОписьИНВ9";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации драгоценных камней (ИНВ-9)'");
	КомандаПечати.Порядок		= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияДрагКамнейВИК";
	КомандаПечати.Идентификатор = "ИнвОписьИНВ9фактНаличие";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации драгоценных камней (ИНВ-9) (факт. наличие)'");
	КомандаПечати.Порядок		= 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияДрагКамнейВИК";
	КомандаПечати.Идентификатор = "ПечатьИнв22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации (ИНВ-22)'");
	КомандаПечати.Порядок		= 3;
		
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ИнвОписьИНВ9") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(	
											КоллекцияПечатныхФорм,
											"ИнвОписьИНВ9",
											"Акт инвентаризации драгоценных камней (ИНВ-9) (ф. 0317009)",
											ПечатьИнвОписиИНВ9(МассивОбъектов, ОбъектыПечати));
											
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ИнвОписьИНВ9фактНаличие") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(	
											КоллекцияПечатныхФорм,
											"ИнвОписьИНВ9фактНаличие",
											"Акт инвентаризации драгоценных камней (ИНВ-9) (ф. 0317009)",
											ПечатьИнвОписиИНВ9(МассивОбъектов, ОбъектыПечати, Истина));
											
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПечатьИнв22") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(	
											КоллекцияПечатныхФорм,
											"ПечатьИнв22",
											"Приказ ИНВ-22",
											ПечатьФормыИНВ22(МассивОбъектов, ОбъектыПечати));
											
	КонецЕсли;
		
КонецПроцедуры // Печать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьИнвОписиИНВ9(МассивОбъектов, ОбъектыПечати, ВыводитьФактНаличие = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка,
	|	КОЛИЧЕСТВО(ИнвентаризацияДрагКамнейВИКИнвентаризация.НомерСтроки) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВсегоСтрокВИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК.Инвентаризация КАК ИнвентаризацияДрагКамнейВИКИнвентаризация
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ПОДСТРОКА(ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.Наименование, 1, 30) + ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.Код
	|		ИНАЧЕ ПОДСТРОКА(ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.Наименование, 1, 30) + ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.Код + ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер.Код
	|	КОНЕЦ КАК КлючОбъекта,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ОбъектыНФА
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК.Инвентаризация КАК ИнвентаризацияДрагКамнейВИКИнвентаризация
	|ГДЕ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыНФА.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(ОбъектыНФА.Количество) КАК КоличествоОбъектов
	|ПОМЕСТИТЬ ДанныеОКоличествеОбъектов
	|ИЗ
	|	ОбъектыНФА КАК ОбъектыНФА
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыНФА.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияДрагКамнейВИК.Ссылка КАК Ссылка,
	|	ИнвентаризацияДрагКамнейВИК.Номер КАК Номер,
	|	ИнвентаризацияДрагКамнейВИК.ДатаИнвентаризации КАК Дата,
	|	ИнвентаризацияДрагКамнейВИК.Организация,
	|	ИнвентаризацияДрагКамнейВИК.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ИнвентаризацияДрагКамнейВИК.Подразделение.Наименование КАК НаименованиеПодразделения,
	|	ИнвентаризацияДрагКамнейВИК.Организация.КодОКПО КАК КодОКПО,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияДрагКамнейВИК.ЦМО ССЫЛКА Справочник.ЦМО
	|			ТОГДА ИнвентаризацияДрагКамнейВИК.ЦМО.Сотрудник.Контрагент.ЮридическоеФизическоеЛицо.Наименование
	|		КОГДА ИнвентаризацияДрагКамнейВИК.ЦМО ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ИнвентаризацияДрагКамнейВИК.ЦМО.Контрагент.ЮридическоеФизическоеЛицо.Наименование
	|	КОНЕЦ КАК ПолноеФИОМОЛ,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияДрагКамнейВИК.ЦМО ССЫЛКА Справочник.ЦМО
	|			ТОГДА ИнвентаризацияДрагКамнейВИК.ЦМО.Сотрудник
	|		КОГДА ИнвентаризацияДрагКамнейВИК.ЦМО ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ИнвентаризацияДрагКамнейВИК.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ИнвентаризацияДрагКамнейВИК.НомерПриказаИнвентаризации КАК НомерПриказа,
	|	ИнвентаризацияДрагКамнейВИК.ДатаПриказаИнвентаризации КАК ДатаПриказа,
	|	ИнвентаризацияДрагКамнейВИК.МестоИнвентаризации,
	|	ИнвентаризацияДрагКамнейВИК.ДатаНачала КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияДрагКамнейВИК.ДатаОкончания КАК ДатаОкончанияИнвентаризации,
	|	ИнвентаризацияДрагКамнейВИК.ДолжностьПредседателяКомиссии,
	|	ИнвентаризацияДрагКамнейВИК.ФамилияПредседателяКомиссии,
	|	ИнвентаризацияДрагКамнейВИК.ИмяПредседателяКомиссии,
	|	ИнвентаризацияДрагКамнейВИК.ОтчествоПредседателяКомиссии,
	|	ВсегоСтрокВИнвентаризации.КоличествоСтрок,
	|	ДанныеОКоличествеОбъектов.КоличествоОбъектов
	|ИЗ
	|	ДанныеОКоличествеОбъектов КАК ДанныеОКоличествеОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияДрагКамнейВИК КАК ИнвентаризацияДрагКамнейВИК
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВсегоСтрокВИнвентаризации КАК ВсегоСтрокВИнвентаризации
	|			ПО (ВсегоСтрокВИнвентаризации.Ссылка = ИнвентаризацияДрагКамнейВИК.Ссылка)
	|		ПО ДанныеОКоличествеОбъектов.Ссылка = ИнвентаризацияДрагКамнейВИК.Ссылка
	|ГДЕ
	|	ИнвентаризацияДрагКамнейВИК.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.Ссылка КАК Ссылка,
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.НомерСтроки,
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.ДолжностьЧленаКомиссии,
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.ФамилияЧленаКомиссии,
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.ИмяЧленаКомиссии,
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК.СоставКомиссии КАК ИнвентаризацияДрагКамнейВИКСоставКомиссии
	|ГДЕ
	|	ИнвентаризацияДрагКамнейВИКСоставКомиссии.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка КАК Ссылка,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА КАК ОбъектНФА,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.НаименованиеПолное = """"""""
	|			ТОГДА ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.Наименование
	|		ИНАЧЕ ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер КАК ИнвНомер,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА.Код КАК Код,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ЕдиницаИзмерения.Код КАК ОКЕИ,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ЕдиницаИзмерения.Представление КАК НаименованиеЕдиницы,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Количество КАК Количество,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	ВЫРАЗИТЬ(ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер.ЗаводскойНомер КАК СТРОКА(1000)) КАК ЗаводскойНомер,
	|	ВЫРАЗИТЬ(ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер.НомерПаспорта КАК СТРОКА(1000)) КАК НомерПаспорта,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК.Инвентаризация КАК ИнвентаризацияДрагКамнейВИКИнвентаризация
	|ГДЕ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Ссылка,
	|	ОбъектНФА,
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ОбъектНФА КАК ОбъектНФА,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ИнвентарныйНомер КАК ИнвНомер,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.ВидДрагМатериала КАК ВидДрагМатериала,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.МассаДМУчет КАК МассаП,
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.КоличествоДМУчет КАК КоличествоП,
	|	ВЫБОР
	|		КОГДА &ВыводитьФактНаличие
	|			ТОГДА ИнвентаризацияДрагКамнейВИКИнвентаризация.МассаДМФакт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК МассаФ,
	|	ВЫБОР
	|		КОГДА &ВыводитьФактНаличие
	|			ТОГДА ИнвентаризацияДрагКамнейВИКИнвентаризация.КоличествоДМФакт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоФ
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК.Инвентаризация КАК ИнвентаризацияДрагКамнейВИКИнвентаризация
	|ГДЕ
	|	ИнвентаризацияДрагКамнейВИКИнвентаризация.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДрагМатериала";
	
	
	Запрос.УстановитьПараметр("МассивОбъектов", 		МассивОбъектов); 
	Запрос.УстановитьПараметр("ВыводитьФактНаличие",	ВыводитьФактНаличие);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	МассивДанных = Запрос.ВыполнитьПакет();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктИнвентаризацииИНВ9_0317010");
	
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодписиМОЛ		= Макет.ПолучитьОбласть("ПодписиМОЛ");
	ОбластьПодвалЗаголовка	= Макет.ПолучитьОбласть("ПодвалЗаголовка");
	
	ОбластьЕдиницыИзмерения	= Макет.ПолучитьОбласть("ТаблицаЕдиницИзмерения");
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ОбластьИтогоПоСтранице 			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьИтогоПоАктуЧисло			= Макет.ПолучитьОбласть("ИтогоПоАктуЧисло");
	ОбластьИтогоПоСтраницеЗаг 		= Макет.ПолучитьОбласть("ИтогоПоСтраницеЗаг");
	
	ОбластьПодвалНачало				= Макет.ПолучитьОбласть("ИтогоПоАкту");
	ОбластьИтоги					= Макет.ПолучитьОбласть("Итоги");
	ОбластьДопСтрока				= Макет.ПолучитьОбласть("ДопСтрока");
	
	ОбластьКомиссия					= Макет.ПолучитьОбласть("Комиссия");
	ОбластьПодвалСередина			= Макет.ПолучитьОбласть("ПодвалСередина");
	ОбластьПодвалКонец				= Макет.ПолучитьОбласть("ПодвалКонец");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	ВыборкаШапка = МассивДанных[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия = МассивДанных[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбъекты = МассивДанных[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСтроки = МассивДанных[6].Выбрать(); 
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеМОЛ = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, НаименованиеПолное, Должность",
									ВыборкаШапка.ЦМО, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеМОЛ, Истина);
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьЗаголовок,"НомерАкта",ВыборкаШапка.Номер,ВыборкаШапка.Ссылка,, Истина);

		ПараметрыЗаполнения = Новый Структура(
										"ПолноеФИОМОЛ, МолДолжность, МолНаименование",
											ДанныеМОЛ.НаименованиеПолное,
											ДанныеМОЛ.Должность,
											КорреспондентыКлиентСервер.ФИО(ДанныеМОЛ));
		ОбластьПодписиМОЛ.Параметры.Заполнить(ПараметрыЗаполнения);
		
		НомерСтроки = 1;
		
		//------вывод на печать------------																				
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьПодписиМОЛ);
		ТабличныйДокумент.Вывести(ОбластьПодвалЗаголовка);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    //--------------------------------------------------------------------------------------------------------------
		
		ТабличныйДокумент.Вывести(ОбластьЕдиницыИзмерения);
		
		ТекущаяСтрока = 0;
		СтрокНаСтранице	= 0;
		КоличествоП	= 0;
		МассаП		= 0;
		КоличествоФ	= 0;
		МассаФ		= 0;
		
		ИтогоКоличествоП	= 0;
		ИтогоМассаП			= 0;
		ИтогоКоличествоФ	= 0;
		ИтогоМассаФ			= 0;
		
		КоличествоСтрок = ВыборкаШапка.КоличествоСтрок + ВыборкаШапка.КоличествоОбъектов;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
	    ВыборкаОбъекты.Сбросить();
		СчетчикОбъектов = 1;
	    Если ВыборкаОбъекты.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка)) Тогда
	    	ВыборкаОбъектыНФА = ВыборкаОбъекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОбъектыНФА.Следующий() Цикл
				
				ВыборкаИнвНомер = ВыборкаОбъектыНФА.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаИнвНомер.Следующий() Цикл
					Выборка = ВыборкаИнвНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока Выборка.Следующий() Цикл
						
						КодОбъектаНФА = ВыборкаОбъектыНФА.Код;
						Если ТипЗнч(ВыборкаОбъектыНФА.ОбъектНФА) = Тип("СправочникСсылка.Номенклатура") Тогда
							НоменклатурныйНомерМЗ = ВыборкаОбъектыНФА.ОбъектНФА.НоменклатурныйНомер;
							Если ЗначениеЗаполнено(НоменклатурныйНомерМЗ) Тогда
								КодОбъектаНФА = НоменклатурныйНомерМЗ;
							КонецЕсли;	
						КонецЕсли;	
				
						СтруктураОбъектаНФА = Новый Структура("Ном, НаименованиеНФА, КодНФА, ЕдИзм, Количество, НомерИзделия, КоличествоП, МассаП, КоличествоФ, МассаФ",
						                                    СчетчикОбъектов,
															ВыборкаОбъектыНФА.Наименование,
															КодОбъектаНФА,
															Выборка.НаименованиеЕдиницы,
															ВыборкаИнвНомер.Количество,
															ВыборкаИнвНомер.ИнвНомер,
															0,
															0,
															0,
															0
															);
						
						ОбластьСтрока.Параметры.Заполнить(СтруктураОбъектаНФА);
						ТабличныйДокумент.Вывести(ОбластьСтрока);
						
						СчетчикДМ = 1;
						
						ВыборкаСтроки.Сбросить();
						Пока ВыборкаСтроки.НайтиСледующий(Новый Структура("Ссылка, ОбъектНФА, ИнвНомер", ВыборкаШапка.Ссылка, ВыборкаОбъектыНФА.ОбъектНФА, ВыборкаИнвНомер.ИнвНомер)) Цикл
							
							СтруктураДрагМатериала = Новый Структура("Ном, НаименованиеНФА, КодНФА, ЕдИзм, Количество, НомерИзделия, КоличествоП, МассаП, КоличествоФ, МассаФ",
							                                    Строка(СчетчикОбъектов)+"."+Строка(СчетчикДМ),
																"  "+ВыборкаСтроки.ВидДрагМатериала,
																"",
																"",
																0,
																"",
																ВыборкаСтроки.КоличествоП,
																ВыборкаСтроки.МассаП,
																ВыборкаСтроки.КоличествоФ,
																ВыборкаСтроки.МассаФ
																);
							
							ОбластьСтрока.Параметры.Заполнить(СтруктураДрагМатериала);
							ТабличныйДокумент.Вывести(ОбластьСтрока);
							
							СчетчикДМ = СчетчикДМ + 1;
							
							ТекущаяСтрока = ТекущаяСтрока + 1;
							СтрокНаСтранице = СтрокНаСтранице + 1;
							
							// проверим вывод
							
							Массив = Новый Массив;       
							Массив.Добавить(ОбластьСтрока);
							Массив.Добавить(ОбластьИтогоПоСтранице);
							Если ТекущаяСтрока = КоличествоСтрок Тогда
								Массив.Добавить(ОбластьИтогоПоАктуЧисло);
							КонецЕсли;
							Массив.Добавить(ОбластьИтогоПоСтраницеЗаг);
							Массив.Добавить(ОбластьИтоги);
							Если Не ТабличныйДокумент.ПроверитьВывод(Массив) Тогда
								
								ПараметрыЗаполнения = Новый Структура;
								ПараметрыЗаполнения.Вставить("КоличествоП", КоличествоП);
								ПараметрыЗаполнения.Вставить("МассаП", 		МассаП);
								ПараметрыЗаполнения.Вставить("КоличествоФ", КоличествоФ);
								ПараметрыЗаполнения.Вставить("МассаФ", 		МассаФ);
								ОбластьИтогоПоСтранице.Параметры.Заполнить(ПараметрыЗаполнения);
								ТабличныйДокумент.Вывести(ОбластьИтогоПоСтранице);
								
								ТабличныйДокумент.Вывести(ОбластьИтогоПоСтраницеЗаг);
								ВывестиИтогиПоСтраницеИНВ9(	ТабличныйДокумент,
																ОбластьИтоги, 
																СтрокНаСтранице,
																КоличествоФ,
																МассаФ,
																ВыводитьФактНаличие);
								ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();												
								ТабличныйДокумент.Вывести(ОбластьШапка);
								
								СтрокНаСтранице	= 0;
								КоличествоП		= 0;
								МассаП			= 0;
								КоличествоФ		= 0;
								МассаФ			= 0;
								
							КонецЕсли;
							
							КоличествоП 	= КоличествоП  	+ ВыборкаСтроки.КоличествоП;
							МассаП			= МассаП 		+ ВыборкаСтроки.МассаП;
							КоличествоФ 	= КоличествоФ  	+ ВыборкаСтроки.КоличествоФ;
							МассаФ			= МассаФ 		+ ВыборкаСтроки.МассаФ;
							
							ИтогоКоличествоП	= ИтогоКоличествоП + ВыборкаСтроки.КоличествоП;
							ИтогоМассаП			= ИтогоМассаП + ВыборкаСтроки.МассаП;
							ИтогоКоличествоФ	= ИтогоКоличествоФ + ВыборкаСтроки.КоличествоФ;
							ИтогоМассаФ			= ИтогоМассаФ + ВыборкаСтроки.МассаФ;
							
						КонецЦикла;
						СчетчикОбъектов = СчетчикОбъектов + 1;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;	
		
		Массив = Новый Массив;
		Массив.Добавить(ОбластьПустаяСтрока);
		Массив.Добавить(ОбластьПустаяСтрока);
		Массив.Добавить(ОбластьИтогоПоСтранице);
		Массив.Добавить(ОбластьИтогоПоАктуЧисло);
		Массив.Добавить(ОбластьИтогоПоСтраницеЗаг);
		Массив.Добавить(ОбластьИтоги);
		
		Пока ТабличныйДокумент.ПроверитьВывод(Массив) Цикл
			ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("КоличествоП", КоличествоП);
		ПараметрыЗаполнения.Вставить("МассаП", 		МассаП);
		ПараметрыЗаполнения.Вставить("КоличествоФ", КоличествоФ);
		ПараметрыЗаполнения.Вставить("МассаФ", 		МассаФ);
		ОбластьИтогоПоСтранице.Параметры.Заполнить(ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(ОбластьИтогоПоСтранице);
		
		ПараметрыЗаполнения.КоличествоП	= ИтогоКоличествоП;
		ПараметрыЗаполнения.МассаП		= ИтогоМассаП;
		ПараметрыЗаполнения.КоличествоФ	= ИтогоКоличествоФ;
		ПараметрыЗаполнения.МассаФ		= ИтогоМассаФ;
		ОбластьИтогоПоАктуЧисло.Параметры.Заполнить(ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(ОбластьИтогоПоАктуЧисло);
		
		ТабличныйДокумент.Вывести(ОбластьИтогоПоСтраницеЗаг);
		ВывестиИтогиПоСтраницеИНВ9(	ТабличныйДокумент,
										ОбластьИтоги, 
										СтрокНаСтранице,
										КоличествоФ,
										МассаФ,
										ВыводитьФактНаличие);
		
	    //--------------------------------------------------------------------------------------------------------------
	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ОбластьПодвалНачало);
		ПараметрыЗаполнения.КоличествоП	= ИтогоКоличествоП;
		ПараметрыЗаполнения.МассаП		= ИтогоМассаП;
		ПараметрыЗаполнения.КоличествоФ	= ИтогоКоличествоФ;
		ПараметрыЗаполнения.МассаФ		= ИтогоМассаФ;
		
		ВывестиИтогиПоСтраницеИНВ9(	ТабличныйДокумент,
										ОбластьИтоги, 
										ВыборкаШапка.КоличествоСтрок,
										ИтогоКоличествоФ,
										ИтогоМассаФ,
										ВыводитьФактНаличие);
										
		ТабличныйДокумент.Вывести(ОбластьДопСтрока);
	
		ВыборкаКомиссия.Сбросить();
		ВыборкаКомиссия.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка));
		
		ОбластьВсяКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(	ВыборкаШапка, 
																						ВыборкаКомиссия.Выбрать(), 
																						ОбластьКомиссия, 
																						3);
		
		ТабличныйДокумент.Вывести(ОбластьВсяКомиссия);
		
		Если СчетчикОбъектов > 1 Тогда
			ПервыйНомерСтр = "1";
			ПоследнийНомерСтр = Строка(СчетчикОбъектов-1);
		Иначе
			ПервыйНомерСтр = "_______";
			ПоследнийНомерСтр = "_______";
		КонецЕсли;
		
		ОбластьПодвалСередина.Параметры.ПервыйНомер = ПервыйНомерСтр;
		ОбластьПодвалСередина.Параметры.ПоследнийНомер = ПоследнийНомерСтр;
		
		ТабличныйДокумент.Вывести(ОбластьПодвалСередина);
		ТабличныйДокумент.Вывести(ОбластьПодписиМОЛ);
		ТабличныйДокумент.Вывести(ОбластьПодвалКонец);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	

Процедура ВывестиИтогиПоСтраницеИНВ9(	ТабличныйДокумент,
											ОбластьИтоги,
											КоличествоСтрок,
											КоличествоФ = 0,
											МассаФ = 0,
											ВыводитьФактНаличие = Ложь)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КоличествоПорядковыхНомеровПрописью", ЧислоПрописью(КоличествоСтрок,, ",,,м,,,,,0"));
	Если ВыводитьФактНаличие Тогда
		СтруктураПараметров.Вставить("КоличествоФактическоеПрописью",
				УчетДрагМатериалов.КоличествоМЦПрописью(КоличествоФ));
		СтруктураПараметров.Вставить("МассаФактическаяПрописью",
				УчетДрагМатериалов.МассаДрагМатериаловПрописью(МассаФ));
	КонецЕсли;
	
	ОбластьИтоги.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтоги);

КонецПроцедуры

Функция ПечатьФормыИНВ22(МассивОбъектов, ОбъектыПечати) 
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ИмяПараметровПечати = "ИнвентаризацияДрагКамней_ПечатьФормыИНВ22";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ИНВ22");

	ЗапросПечать = Новый Запрос();
	ЗапросПечать.УстановитьПараметр("ВидИнвЛомОтходы",	Перечисления.ВидыИнвентаризацииДрагМатериалов.ИнвентаризацияДрагКамнейВЛомеОтходах);
	ЗапросПечать.УстановитьПараметр("МассивСсылок",		МассивОбъектов);
	ЗапросПечать.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК ДокСсылка,
	|	Док.Номер КАК Номер,
	|	Док.ДатаИнвентаризации КАК Дата,
	|	Док.Организация КАК Организация,
	|	Док.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	Док.Организация.КодОКПО КАК КодОКПО,
	|	Док.Подразделение.Наименование КАК НаименованиеПодразделения,
	|	Док.НомерПриказаИнвентаризации КАК НомерПриказаИнвентаризации,
	|	Док.ДатаПриказаИнвентаризации КАК ДатаПриказаИнвентаризации,
	|	""Драгоценные камни, природные алмазы и изделия из них"" КАК НаименованиеИмуществаОбязательств,
	|	Док.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	Док.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	Док.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	Док.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ПричинаИнвентаризации КАК ПричинаПроведенияИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК КАК Док
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка КАК ДокСсылка,
	|	ТЧ.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	ТЧ.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	ТЧ.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	ТЧ.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ИнвентаризацияДрагКамнейВИК.СоставКомиссии КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В(&МассивСсылок)
	|ИТОГИ ПО
	|	ДокСсылка";
	
	ЗапросПечать.ВыполнитьПакет();
	
	Результаты = ЗапросПечать.ВыполнитьПакет();
	
	ВыборкаШапка		= Результаты[0].Выбрать();
	ВыборкаДокКомиссия	= Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаШапка.Следующий() Цикл
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьКомиссия	= Макет.ПолучитьОбласть("Комиссия");
		ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
		
		ПоискТекущегоДокумента = Новый Структура("ДокСсылка", ВыборкаШапка["ДокСсылка"]);
		ВыборкаДокКомиссия.Сбросить();
		ЕстьВыборкаДокКомиссия = ВыборкаДокКомиссия.НайтиСледующий(ПоискТекущегоДокумента);
		
		КоличествоСтрок = 0;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент	= Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		НомерСтраницы = 1;
		ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьШапка,"Номер",ВыборкаШапка.Номер,ВыборкаШапка.ДокСсылка,,Истина);
		ТабДокумент.Вывести(ОбластьШапка);
		
		ОбластьВсяКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(
			ВыборкаШапка,
			ВыборкаДокКомиссия.Выбрать(), 
			ОбластьКомиссия, 
			3);
		ТабДокумент.Вывести(ОбластьВсяКомиссия);
		
		Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
			ВыборкаШапка["Организация"],
			ВыборкаШапка["Дата"]);
		ЗначенияПараметров = Новый Структура();
		ЗначенияПараметров.Вставить("ДолжностьРуководителя",	Руководитель["ДолжностьПредставление"]);
		ЗначенияПараметров.Вставить("ФИОРуководителя",			КорреспондентыКлиентСервер.ФИО(Руководитель["ОтветственноеЛицоФИО"]));
		ЗначенияПараметров.Вставить("ДатаНачала",		Формат(ВыборкаШапка["ДатаНачала"], "ДФ=dd.MM.yyyy"));
		ЗначенияПараметров.Вставить("ДатаОкончания",	Формат(ВыборкаШапка["ДатаОкончания"], "ДФ=dd.MM.yyyy"));
		ОбластьПодвал.Параметры.Заполнить(ВыборкаШапка);
		ОбластьПодвал.Параметры.Заполнить(ЗначенияПараметров);
		ТабДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабДокумент, 
			НомерСтрокиНачало,
			ОбъектыПечати,
			ВыборкаШапка.ДокСсылка);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
